class PirithInfo {
  final int position;
  final String name;

  final String description;
  final String mainImage;
  final String image2;
  final String image3;

  PirithInfo(
    this.position, {
    this.name,
    this.description,
        this.mainImage,
        this.image2,
        this.image3,
  });
}

List<PirithInfo> piriths = [
  PirithInfo(
    1,
   // mainImage:'assets/chilli.jpg' ,
    name: 'කොම්පෝස්ට්\nපොහොර\n',
    description: "   ",
  ),
  PirithInfo(
    1,
    mainImage:'assets/grapes.jpg' ,
    image2:'assets/grapes1.jpg',
    image3: 'assets/grapes2.jpg',
    name: 'මිදි\nවගාව\n',
    description: "නිර්දේශිත වර්ග\n\nකාඩිනල්\nඊශ්රායල් බ්ලූ\nඉසබෙලා(වැඩිදියුණු කල)\nසෙම්ලෝන්\nබ්ලැක් මස්කට්\n\n\n\n මිදි වගාවට වඩාත් උචිත වන්නෙ වියලි කලාපයයි.ඉතා හොදින් ජලය බැස යන සහ මූල පද්ධතිය වඩා පහසුවෙන් විහිදී යා හැකි පසක් විය යුතු ය.එමනිසා මිදි වගා කිරීම ට කලින් එම ස්ථාන වල පස වඩාත් ගැඹුරට පෙරළිය යුතු ය.සාමාන්යයෙන් එක වලක උස * පළල * දිග  1m බැගින් විය යතු ය.ඉන් අනතුරුව ගොම සහ කොම්පෝස්ට් පොහොර යොදා මසක පමන කාලයක් තැබිය යුතු ය.අනතුරුව නැවත පස පෙරළා පැලය සිටුවා ගන්න.\n\n මිදි පැල ලාබාගැනීම මිදි අතු වලින් සිදු කල හැකි ය.මේ සදහා මිදිවැලේ දුඹුරු පැහැ අතු භාවිතා කල හැකි ය.දිග අගල් 8 ක් පමන වන ලෙස මිදි දඩු කිහිපයක් කපා ඒවා එකට බැද හරස් අතට අතුරා වැලිතට්ටුවකින් වසා දිනපතා ජලය යෙදීම සිදු කල යුතු ය.දින 12 කට පසුව මෙම අතු කැබලි පොලිතින් බදුන්වල සිටුවීම සදහා සුදුසු ය.එම පැළ පහත අාකාරයට සිටුවිය හැකි ය. ",
  ),
  PirithInfo(
    1,
    mainImage:'assets/mango.jpg' ,
    name: 'අඹ\nවගාව\n',
    description: "  1. ",
  ),
  PirithInfo(
    1,
    mainImage:'assets/papaya.jpg' ,
    name: 'පැපොල්\nවගාව\n',
    description: "  1. ",
  ),
  PirithInfo(
    1,
    mainImage:'assets/pineapple.jpg' ,
    name: 'අන්නාසි\nවගාව\n',
    description: "  1. ",
  ),
  PirithInfo(
    1,
    mainImage:'assets/banana.jpg' ,
    image2:'assets/banana1.jpg',
    name: 'කෙසෙල්\nවගාව\n',
    description: " කෙසෙල් භෝගය පලතුරක් ලෙස මෙන්ම එළවලුවක් ලෙසද භාවිතා කෙරේ.කෙසෙල් වගාවට මනා වර්ෂාපතනයක් අවශ්යය වේ.එසෙ නොමැතිනම් හොදින් ජල සම්පාදනය කල යුතු වේ.ලෝම පස වඩාත් උචිත වේ.\n\n\n\n1. කෙසෙල් පැළ ලබාගැනීම.\n\n මේ සදහා ලෙඩ රෝග වලින් තොර හොදින් වැඩුණු කෙසෙලර ගසක මොරෙයියන් යොදා ගත හැකිය.මොරෙයියන්ගෙ වයස මාස 4 ක් පමන වන විට ඒවා ගලවා මුල් කප්පාදු කර සිටුවාගත යතු ය.\n\n\n\n2. පැළ සිටුවීම\n\nවගාව සදහා වල් සැකසිය යුත්තෙ 2 x 2 ව 2 පරිමාණයටය. ගස් අතර අඩි 8 ක පරතරයක් පවතින ලෙස වල් සැකසිය යුතු ය.සිටුවීමට පෙර පොහොර ලෙස ගොම පොහොර යොදා ගත හැකිය.\n\n\n\n3. රෝග සහ පළිබෝධිකයින්\n\n\nකෙසෙල් රෝගයට බලපාන බොහොමයක් දිලීර රෝගවලට හේතුව දුර්වල ජල සම්පාදනයයි.\n\nමේරු පත්ර කහ පාට වී කඩා වැටීම සහ සමහර විට කද දිගට පැලි යාම.(මේ සදහා කෙසෙල් ශාකයේ මූල පද්ධතියට අලු හුණු යෙදිය යතු ය.)\n\nකෙසෙල් කද විදින සතුන්ගෙන් ආරක්ෂා කර ගත යුතු ය.\n\n\n\n4. අස්වනු නෙලීම.\n\nමාස 9 කදී (ඇඹුල් 96 දින/ආනමාලු 80/කෝලිකුට්ටු 120) කෙසෙල් ගස පීදෙන අතර මාස 3 කදී පමන කැන් කපා ගත හැකි ය.  ",
  ),
  PirithInfo(
    1,
    mainImage:'assets/orange.jpg' ,
    image2:'assets/orange1.jpg',
    name: 'දෙහි &\nදොඩම්\nවගාව',
    description: "1. බීජ සිටුවීම.\n\nමේ සදහා සුදුසු ශාකයක් ඔබ විසින් තෝරාගත යුතු ය.එම බීජ ලබාගත් විගසම තවාන් කිරීම සිදුකල යුතු වේ.තවානෙන් ලබාගන්නා පැල බදුන්වල සිටුවා මාස 5 කර පමන වර්ධනය වීමට ඉඩ හැර පොලොවෙ සිටුවීම වඩා උචිත වේ.\n\n\n\n2. සිටුවන භූමිය සැකසීම.\n\nහොදින් ජලය බැස යන ලෝම පසක් වඩාත් උචිත වේ.පැළ සිටුවීමට 60cm x 60චම ඳ 60චම විශාලත්වයෙ වලවල් කපාගත යුතු අතර වලවල් 2 ක් අතර පරතරය 4m පමන විය යුතු ය.මතුපිට පස් සහ ගොම එකට මිශ්ර කර සිටුවන මාධ්යය සකසා ගත යුතු වේ.එමෙන්ම පැල සිටුවීමට සති 2 කට පෙර ඩොලමයිට් 400g පමන සහ කාබනික පොහොර 8kg පමන යොදන්න.\n\n\n\n3. ගෙඩි හට ගැනීම ක්රමවත් කිරීමට.\n\n\nගසට හොදින් හිරු එලිය ලබා දෙන්න.ගසෙ ප්රධාන අතුවල පොල් ලෙලි එල්ලන්න.\n\nමල් වාරයක් ආරම්භ වීමට මාස 2 කට පමන පෙර සිට දිනපතා ජලය යොදන්න.\n\nඵල මෝරන විට පස වියලීමට හරින්න.           ",
  ),
  PirithInfo(
    1,
    name: 'ABOUT\nTHIS\nAPPLICATION',
    description: "App icon & images sourced from:\n\n\n\n'https://pixabay.com/' ( CC0 )\n\nhttps://www.maxpixel.net/Fresh-Vegetable-Insects-Cabbage-Vegetables-Worms-5171622 ",
  ),






  PirithInfo(
    1,
    mainImage:'assets/eggplant.jpg' ,
    name: 'වම්බටු\nවගාව\n',
    description: "  1. ",
  ),
  PirithInfo(
    1,
    mainImage:'assets/ladyfinger.jpg' ,
    name: 'බණ්ඩක්කා\nවගාව\n',
    description: "  1. ",
  ),
  PirithInfo(
    1,
    mainImage:'assets/cucumbers.jpg' ,
    name: 'පිපිඤ්ඤා\nවගාව\n',
    description: "  1. ",
  ),
  PirithInfo(
    1,
    name: 'නිවිති\nවගාව\n',
    description: "  1. ",
  ),
  PirithInfo(
    1,
     mainImage:'assets/bittermelon.jpg' ,
    name: 'කරවිල\nවගාව\n',
    description: "  1. ",
  ),
  PirithInfo(
    1,
    name: 'පතෝල\nවගාව\n',
    description: "  1. ",
  ),
  PirithInfo(
    1,
     mainImage:'assets/beans.jpg' ,
    name: 'වැල්\nබෝංචි\nවගාව',
    description: "  1. ",
  ),
  PirithInfo(
    1,
    mainImage:'assets/raddish.jpg' ,
    name: 'රාබු\nවගාව\n',
    description: "1.රාබු නිර්දේශිත වර්ග\න\නබීරලු රාබු\නරතු රාබු\නදිග රාබු\නබෝල රාබු\න\න\න ",
  ),
  PirithInfo(
    1,
    mainImage:'assets/carrot.jpg' ,
    name: 'කැරට්\nවගාව\n',
    description: "  1. ",
  ),
  PirithInfo(
    1,
    mainImage:'assets/beetroot.jpg' ,
    name: 'බීට්\nවගාව\n',
    description: "  1. ",
  ),
  PirithInfo(
    1,
    mainImage:'assets/salad.jpg' ,
    image2:'assets/salad2.jpg',
    name: 'සලාද\nවගාව\n',
    description: "1. නිර්දේශිත වර්ග\n\n  මිනොනෙට්\n  ග්රෑන්ඩ් රැපිඩස්\n  ග්රේට් ලේක්ස්\n\n\n\n2. සලාද ඕනෑම පළාතක පහසුවෙන් වගා කර ගත හැකිය.වියලි කලාපයක වගාකරන්නෙ නම් නියමිත ලෙස ජල සම්පාදනය කරගත යුතු වේ.අධික වර්ෂා කාලයේදි පැල ආරක්ෂා කිරීම අතිශය වැදගත් වේ.\n\n\n\n3. බීජ තවාන් කිරීම\n\nඅක්කරයක් සදහා බීජ 175g පමණ අවශ්ය වේ.බීජ තවාන් කිරීමේදි ගොම හෝ කොම්පෝස්ට් පොහොර යොදා බිම සකස් කලයුතු අතර පස ජීවානුහරණය කර තිබීම වැදගත් වේ.(කොළ රොඩු යොදා පුලුස්සා දැමිීම) බීජ පැලවීමට දින 7 ක් පමණ ගතවන අතර කොල 3 ක් පමන පීදි එන විට තවානෙන් ගලවා ක්ෂේත්රයෙ සිටු විය යුතු ය.\n\n\n\n4. පැල සිටු වීමෙදි 10cm පමණ පරතරයක් තබා සිටුවිය යුතු අතර මුල් කාලයේ දිනපතා ජලය යෙදිය යුතු ය.සිටවා සති දෙකකට පසු ව නැවතත් කොම්පෝස්ට් පොහොර යෙදිය යුතු ය.පසුකාලීනව දින 3 කට වරක් ජලය යෙදීම සෑහේ.\n\n\n\n5. රෝග සහ පළිබෝධිකයන්\n\nමුල් කුණු වීමෙ රෝගය බහුලව දැකිය හැකි වේ.එමෙන්ම ශාකයේ පහල පත්ර වල සිට ඉහලට කුණු වීම දැකිය හැකිය.ශාකයේ පහල පත්ර පොළවේ ගැටීම වැලැක්වීම මගින් මග හරවා ගත හැකි ය.ගොලුබෙල්ලන් සහ කියත්පණුවන්ගෙන් වගාව ආරක්ෂා කරගත යුතු වේ.\n\n\n\n6. පැල ක්ෂේත්රයෙ සිටවා මසකින් පමණ අස්වනු නෙලිය හැක.       ",
  ),
  PirithInfo(
    1,
    mainImage:'assets/leeks.jpg' ,
    name: 'ලීක්ස්\nවගාව\n',
    description: "1. නිර්දේශිත වර්ග\n\n  මසල් බර්ග්\n  සමර්\n  ලාජ් ලෝ\n\n\n\n ලීක්ස් උඩරට අතරමැදි කලාපයේ හොදින් වැවේ.අනෙක් පලාත් වලද වගා කල හැකිය. \n\n\n\n2. බීජ තවාන් කිරීම\n\n අක්කරයක බීජ තවාන් කිරීම සදහා ලීක්ස් බීජ 1.5g පමණ උවමනා වේ.මීටරයක් පමණ පලළ, 20cm ක් පමණ උස පාත්ති සකස් කර තවාන් දැමිය යුතුය.පසෙ pH අගය 5 ට වඩා අඩු නම් ඩොලමයිට් හෝ අලු හුණු යොදන්න.එමෙන්ම දිරා ගිය ගොම පොහොරද තවානට එක් කරන්න.තවානේ පැල දින 75 ක් පමණ තබා දිගටි පත්ර සහ මුල් කපා ක්ෂේත්රයෙ සිටු වා ගන්න.\n\n\n\n3. ක්ෂේත්රයෙ සිටු වීම\n\n වියලි ගොම හෝ කොම්පෝස්ට් යොදා පස සකස් කල යුතු ය.පේළි අතර පරතරය 30cm සහ පැල අතර 10cm වන ලෙස පාත්ති සකසා ගත යුතුය.ක්ෂෙත්රයෙ සිටවා සති 6 කින් පමන පොහොර යෙදිය යතු අතර සිටවා මුල් කාලයෙ සෑම දිනකම ජලය යෙදිය යුතු ය.පසු කාලීනව දින 4 කට වරක් ජලය යෙදීම සැහේ.\n\n\n\n4. රෝග සහ පළිබොධිකයින්\n\n කොළ දම් පාට වීම සහ සුදු ගොබ රෝගය රෝග ලෙසද පැළමැක්කා සහ කුඩිත්තන් නිතර ලීක්ස් වගාවට හානි කරන පළිබොධිකයින් ද වේ.\n\n\n\n අස්වැන්න මාස 5 කින් පමන ලබා ගත හැකිය.  ",
  ),
  PirithInfo(
    1,
     mainImage:'assets/cabbage.jpg' ,
    name: 'ගෝවා\nවගාව\n',
    description: "  1. ",
  ),
  PirithInfo(
    1,
    mainImage:'assets/potatoes.jpg' ,
    name: 'අර්තාපල්\nවගාව\n',
    description: "  1. ",
  ),
  PirithInfo(
    1,
    mainImage:'assets/onion.jpg' ,
    name: 'ලොකුලූණු\nවගාව\n',
    description: "  1. ",
  ),

  PirithInfo(
    1,
    //mainImage:'assets/ginger.jpg' ,
    name: 'HOW TO\nSTOP\nADS',
    description: "මෙම ඇන්ඩ්රොයිඩ් යෙදුමෙහි ක්රියාකාරිත්වයට කිසිදු අන්තර්ජාල සබදතාවක් අවශ්ය නොවේ.අන්තර්ජාල දැන්වීම් වලින් සිදුවන අපහසුතාවයන් මගහරවා ගැනීමට කරුණාකර ඔබෙ උපාංගයේ අන්තර්ජාල සබදතාව ක්රියා විරහිත කරන්න.\n\n\n  Please turn off your data connection and restart this app again",
  ),



  PirithInfo(
    1,
    mainImage:'assets/ginger.jpg' ,
    name: 'ඉගුරු\nවගාව\n',
    description: "  1. ",
  ),
  PirithInfo(
    1,
    mainImage:'assets/turmeric.png' ,
    name: 'කහ\nවගාව\n',
    description: "  මුහුදු මට්ටමේ සිට මීටර 1,500ක් දක්වා උස් ප්‍රදේශවල කහ වගා කළ හැකිය. තව ද වියලි කලාපයේ ජල සම්පදාන තත්වයන් යටතේද කහ වගා කළ හැකි වේ. වර්ෂාපතනය මි.මී 1500ක් හෝ ඊට වැඩි ප්‍රමණයක් අවශ්‍ය වන අතර  මනා වර්ධනයක් සදහා සුදුසු පරිසර උෂ්නත්වය 20-35 C  අතර වේ විවිධ පස් වර්ග වල කහ වගා කළ හැකි වුවත් මනා ජල වහනයක් ඇති කාබනික ද්‍රව්‍ය සහිත වැලි ලෝම පස ඉතා යෝගය වේ. දුර්වල ජල වහනයක් සහිත පස්, ගල් බොරලු අදික පස් සහ මැටි පසද  කහ වගාවට සුදුසු නොවේ.  ",
  ),
  PirithInfo(
    1,
    mainImage:'assets/chilli.jpg' ,
    name: 'මිරිස්\nවගාව\n',
    description: "1. බීජ වර්ග\n\nඑම්.අයි. 1\nඑම්.අයි. 2\nඑම්.අයි වැරණියා 1\nඑම්.අයි.සී.එච්.3\nඑම්.අයි. හොට්\nඑම්.අයි. ග්‍රින්\nකේ.ඒ. 2\nඅරුණළු\nගල්කිරියාගම වරණය\n\n\n\n\n2. වියළි කලාපයෙ හා අතරමැද කලාපයන්හි ඉතා හොඳින් වගා කළ හැකිය.හොඳින් ජලය බැස යන ලෝම පසක් වගාව සඳහා වඩා යෝග්‍යය.\n\n\n\n3. තවාන් කිරීම\n\n  තවාන් සැකසීම සදහා හොදින් හිරු එළිය වැටෙන සහ මැනවින් ජලය බැස යන ස්ථානයක් තෝරා ගත යුතු ය.එම ස්ථානයෙ ගල් බොරලු ඉවත් කර ගත යුතු ය.එමෙන්ම එම ස්ථානයෙ කලින් මිරිස් බටු වැනි බෝග නොසිටවා තිබිය යතු ය.තවාන සැකසීමෙදි පොහොර ලෙස කොම්පෝස්ට් සහ ගොම පොහොර භාවිතා කල හැකි ය.තවාන ජීවානුහරණය කිරීම සදහා කොල රොඩු දමා පුලුස්සා ගත යුතු ය.අනතුරුව 15 cm පරතරයක් ඇති පේලි වලට ඇගිලි පුරුකෙන් භාගයක් වන සෙ බීජ දමා සියුම් පස් වලින් වසා ගන්න.බීජ පැලවීමට දින 8 ක් පමන ගත වේ.එමෙන්ම මිරිස් පැල මුල් කාලයෙ දැඩි අව්රෂ්මියෙන් ආරක්ශා කර ගත යුතු ය.\n\n\n\n4. පැළ සිටුවීම.\n\n තවානෙ පැළ සිටුවා දින 35 කට පමන පසුව භූමියෙ සිටුවිය හැකි ය.පැළ සිටුවීමෙදි හොදින් පස පෙරලා ජලය බැස යන සේ සැකසිය යුතු ය.එමෙනරම සිටු වීමට පෙර කොම්පෝස්ට් පොහොර යොදන්න.භූමියෙ සිටුවීමෙන් පසුව දිනපතා සති 2 ක් පමන ජලය යොදන්න.අනතුරුව නැවතත් පොහොර යෙදිය යතු ය.ඉන්පසුව දින 4 කත වරක් ජලය යෙදීම සෑහෙ.කරල් මෝරා එනවිට ජල සමරපාදනය අඩු කල යුතු ය.\n\n\n\n5. රෝග\n\n\nදියමලන් කෑම : පස ජීවානුහරණය කිරීම සහ ජලය හොදින් ගලා බැසීම ට සැලැස්වීම මගින්.\n\nඇන්ක්රැක්නෝස්:පැල ගලවා පිලිස්සීම හෝ දීලීර නාශක භාවිත ය.(කරල් මත රවුම් පැල්ලම් ඇති වේ.)\n\nකොළ කොඩවීම : දින 4 කට වරක් සබන් දියර භාවිතය(වැඩි පුර භාවිතයෙන් ශාකය ට හානි වේ)\n\n\n\nදින 60 ත් 75 ත් අතර අස්වනු ලබා ගත හැකිය.         ",
  ),
  PirithInfo(
    1,

    name: 'පළිබෝධ\nවිකර්ෂක\n',
    description: "1. ලූණු පොතු භාවිතයෙන්.\n\n හොදින් වසා ගත හැකි බදුනක් ගෙන එයට ලූණු පොතු පුරවන්න ඉන් අනතුරුව ජලය යොදා හොදින් බදුන වසා දින 2 ක් පමන පල් වීමට ඉඩ දී පසුව භාවිතයට ගන්න.\n\n\n\n2. කොහොඹ සහ සබන් වතුර මගින්.\n\nජලය ලීටරයක ට කොහොඹ තෙල් මේස හැන්දක් ද සබන් කුඩු තේ හැදි භාගයක් ද යන අනුපාතයට යොදා භාවිතයට ගන්න. (දින 4 කට වරක් භාවිතා කරන්න.නැතහොත් පත්ර මැල වී යා හැකි ය.)   ",
  ),


];
